Repository: peterlgarland/WinCertes
Catalog: WinCertes/Resources/Program.*.resx
Languages: fr

source: Error
fr: Erreur

# ExampleUsage
source: Typical usage: WinCertes.exe -a -e me@example.com -d test1.example.com -d test2.example.com -p This will automatically create and register account with email me@example.com, and request the certificate for test1.example.com and test2.example.com, then import it into Windows Certificate store (machine context), and finally set a Scheduled Task to manage renewal. "WinCertes.exe -d test1.example.com -d test2.example.com -r" will revoke that certificate.
fr: Utilisation typique: WinCertes.exe -a -e me@example.com -d test1.example.com -d test2.example.com -p Cela créera et enregistrera automatiquement un compte avec l'email me@example.com, et demandez le certificat pour test1.example.com et test2.example.com, puis importez-le dans Magasin de certificats Windows (contexte de la machine) et enfin définir une tâche planifiée pour gérer le renouvellement. "WinCertes.exe -d test1.example.com -d test2.example.com -r" révoquera ce certificat.

# FailedRegisterAccount
source: Could not register ACME service account.
fr: Impossible d'enregistrer le compte de service ACME.

# HTTPorDNS
source: Specify either an HTTP or a DNS validation method.
fr: Spécifiez une méthode de validation HTTP ou DNS.

# LaunchGUI
source: WinCertes.exe: Launched without command line options, use -? to display them. Launching GUI...
fr: WinCertes.exe: Lancé sans options de ligne de commande, utilisez -? pour les afficher. Lancement de l'interface graphique...

# NoAdmin
source: WinCertes.exe: Must be launched as Administrator.
fr: WinCertes.exe: Doit être lancé en tant qu'administrateur.

# NoAdminGUI
source: WinCertes.exe: Must be launched as Administrator. Hold down the Ctrl and Shift keys whilst you Click the WinCertes icon in the Start Menu.
fr: WinCertes.exe: Doit être lancé en tant qu'administrateur.\nMaintenez les touches Ctrl et Maj enfoncées pendant que vous cliquez sur l'icône WinCertes dans le menu Démarrer.

# NoBound
source: Certificate not bound to any IIS site.
fr: Certificat non lié à un site IIS.

# NoCLIforGUI
source: Use no command line arguments to launch the GUI
fr: N'utilisez aucun argument de ligne de commande pour lancer l'interface graphique

# NoDomains
source: At least one domain must be specified
fr: Au moins un domaine doit être spécifié

# NoFindCertificateDomain
source: Could not find certificate matching primary domain {0}. Please check the Subject CN of the certificate you wish to revoke.
fr: Impossible de trouver le certificat correspondant au domaine principal {0}. Veuillez vérifier le sujet CN du certificat que vous souhaitez révoquer.

# NoFindCertificateSerial
source: Could not find certificate matching serial {0}. Please check the Certificate Store.
fr: Impossible de trouver le certificat correspondant au numéro de série {0}. Veuillez vérifier le magasin de certificats.

# OptionBindName
source: IIS site name to bind the certificate to, e.g. "Default Web Site". Defaults to no binding
fr: Nom du site IIS auquel lier le certificat, par ex. "Default Web Site". Par défaut, aucune liaison

# OptionBindPort
source: IIS site port to bind the certificate to, e.g. 443. Defaults to 443, used only if -b is specified
fr: Port du site IIS auquel lier le certificat, par ex. 443. La valeur par défaut est 443, utilisée uniquement si -b est spécifié

# OptionCSP
source: import the certificate into specified csp. By default WinCertes imports in the default CSP
fr: importer le certificat dans le csp spécifié. Par défaut WinCertes importe dans le CSP par défaut

# OptionDomain
source: the domain(s) to enroll (mandatory)
fr: le(s) domaine(s) à inscrire (obligatoire)

# OptionEmail
source: the account email to be used for ACME requests (optional, defaults to no email)
fr: l'adresse e-mail du compte à utiliser pour les demandes ACME (facultatif, pas d'e-mail par défaut)

# OptionExecPolicy
source: Specify the Execution Policy to run the PowerShell Script file e.g. Unrestricted (default=Undefined)
fr: Spécifiez la stratégie d'exécution pour exécuter le fichier de script PowerShell, par ex. Illimité (par défaut=Undefined)

# OptionExtra
source: manages additional certificate(s) instead of the default one, with its own settings. Add an integer index optionally to manage more certs
fr: gère des certificats supplémentaires au lieu de celui par défaut, avec ses propres paramètres. Ajouter un index entier en option pour gérer plus de certificats

# OptionHelp
source: displays this help screen
fr: affiche cet écran d'aide

# OptionListenPort
source: listen on port {N} in standalone mode (for use with -a switch, default 80)
fr: écouter sur le port {N} en mode autonome (à utiliser avec le commutateur -a, 80 par défaut)

# OptionNoCSP
source: does not import the certificate into CSP. Use with caution, at your own risks. REVOCATION WILL NOT WORK IN THAT MODE
fr: n'importe pas le certificat dans CSP. A utiliser avec prudence, à vos risques et périls. LA RÉVOCATION NE FONCTIONNERA PAS DANS CE MODE

# OptionPeriodic
source: should WinCertes create the Windows Scheduler task to handle certificate renewal (default=no)
fr: WinCertes devrait-il créer la tâche du planificateur Windows pour gérer le renouvellement du certificat (par défaut = non)

# OptionRenewal
source: trigger certificate renewal {N} days before expiration, default 30
fr: déclencher le renouvellement du certificat {N} jours avant l'expiration, par défaut 30

# OptionReset
source: reset all configuration parameters
fr: réinitialiser tous les paramètres de configuration

# OptionRevoke
source: should WinCertes revoke the certificate identified by its domains (to be used only with -d). {REASON} is an optional integer between 0 and 5
fr: si WinCertes révoque le certificat identifié par ses domaines (à utiliser uniquement avec -d). {REASON} est un entier facultatif compris entre 0 et 5

# OptionScriptFile
source: PowerShell Core Script file e.g. "C:\Temp\script.ps1" to execute upon successful enrollment (default=none)
fr: Fichier de script PowerShell Core, par ex. "C:\Temp\script.ps1" à exécuter en cas d'inscription réussie (par défaut = aucun)

# OptionService
source: the ACME Service URI to be used (optional, defaults to Let's Encrypt)
fr: l'URI du service ACME à utiliser (facultatif, par défaut Let's Encrypt)

# OptionSetOpt
source: sets configuration options in the form key:value
fr: définit les options de configuration sous la forme clé:valeur

# OptionShow
source: show current configuration parameters
fr: afficher les paramètres de configuration actuels

# OptionSNI
source: add the Server Name Indication Ssl Flag when binding to IIS
fr: ajouter l'indicateur SSL d'indication de nom de serveur lors de la liaison à IIS

# OptionStandalone
source: should WinCertes create its own WebServer for validation. Activates HTTP validation mode. WARNING: it will use port 80 unless -l is specified
fr: si WinCertes crée son propre serveur Web pour la validation. Active le mode de validation HTTP. ATTENTION : il utilisera le port 80 sauf si -l est spécifié

# OptionWebServer
source: toggles the local web server use and sets its {ROOT} directory (default c:\inetpub\wwwroot). Activates HTTP validation mode
fr: bascule l'utilisation du serveur Web local et définit son répertoire {ROOT} (par défaut c:\inetpub\wwwroot). Active le mode de validation HTTP

# RevokeReason
source: Revocation Reason is a number between 0 and 5
fr: Le motif de révocation est un nombre compris entre 0 et 5

# SuccessBind
source: Successfully bound certificate for IIS site:
fr: Certificat lié avec succès pour le site IIS:

# SuccessRevokeSerialDomains
source: Certificate with serial {0} for domains {1} has been successfully revoked.
fr: Le certificat avec le numéro de série {0} pour les domaines {1} a été révoqué avec succès.
