Repository: peterlgarland/WinCertes
Catalog: WinCertes/Resources/WinCertesOptions.*.resx
Languages: fr

# AuthDNS
source: dns-01 validation
fr: validation dns-01

# AuthIIS
source: http-01 validation with external web server
fr: Validation http-01 avec serveur web externe

source: Auth. Mode:
fr: Mode d'auto:

# AuthStandalone
source: http-01 validation standalone
fr: http-01 validation autonome

# CertificateExpiration
source: Current certificate expiration date is:
fr: La date d'expiration actuelle du certificat est:

# CertificateNotRenewed
source: Certificate exists and does not need to be renewed
fr: Le certificat existe et n'a pas besoin d'être renouvelé

source: days
fr: jours

# Email
source: Account Email:
fr: Compte Email:

# Enrolled
source: Cert Enrolled:
fr: Certificat inscrit:

# ErrorReadWrite
source: Could not Read/Write command line parameters to configuration:
fr: Impossible de lire/écrire les paramètres de ligne de commande pour la configuration:

# ExpirationThreshold
source: Expiration Threshold Date after delay:
fr: Date de seuil d'expiration après délai:

source: Extra Configs:
fr: Configurations supplémentaires:

source: HTTP Port:
fr: Port HTTP:

# IISBind
source: IIS Bind Name:
fr: Nom de liaison IIS:

# ImportCSP
source: Import in CSP:
fr: Importer dans CSP:

source: No
fr: Non

source: None
fr: Rien

# NotConfigured
source: WinCertes is not configured yet
fr: WinCertes n'est pas encore configuré

source: PS Exec Policy:
fr: Politique d'exécution PS:

# PSScript
source: PS Script File:
fr: Fichier de script PS:

source: Registered:
fr: Inscrit:

source: Renewal Delay:
fr: Délai de renouvellement:

source: Service URI:
fr: URI du service:

# SNI
source: SNI Ssl Flag:
fr: Drapeau SNI SSL:

# Task
source: Task Scheduled:
fr: Tâche planifiée:

source: Web Root:
fr: Racine Web:

source: Yes
fr: Oui
