Repository: peterlgarland/WinCertes
Catalog: WinCertes/Resources/WinCertesForm.*.resx
Languages: fr

source: Add
fr: Ajouter

source: Are you sure?
fr: Êtes-vous sûr?

# AttemptRebind
source: This will attempt to Rebind the Certificate to the IIS Site.
fr: Cela tentera de relier le certificat au site IIS.

# BindIISSite
source: Bind to IIS Site
fr: Lier au site IIS

# BindingCertificateIIS
source: Binding Certificate to IIS if required...
fr: Certificat contraignant pour IIS si nécessaire...

# BindingCertToIIS
source: Binding Certificate to IIS Site...
fr: Certificat de liaison au site IIS...

# BindOnRenewal
source: This will bind the Certificate on renewal.
fr: Cela liera le certificat lors du renouvellement.

source: Browse
fr: Parcourir

# CertificateDeleted
source: Certificate successfully deleted.
fr: Certificat supprimé avec succès.

# CertificateHasBeenDeleted
source: Certificate has been successfully deleted.
fr: Le certificat a été supprimé avec succès.

# CertificateHasBeenIssued
source: Certificate has been successfully issued.
fr: Le certificat a été délivré avec succès.

# CertificateHasBeenRevoked
source: Certificate has been successfully revoked.
fr: Le certificat a été révoqué avec succès.

source: Certificate issued.
fr: Certificat délivré.

# CertificateRevoked
source: Certificate successfully revoked.
fr: Certificat révoqué avec succès.

# CertificateWillBeBound
source: Certificate will be bound to IIS Site
fr: Le certificat sera lié au site IIS

# ChallengeNeedsSite
source: IIS Site is required for Challenge Response.
fr: Le site IIS est requis pour la réponse au défi.

source: Check Port
fr: Vérifier le port

# ConfirmDeleteCertificate
source: Would you like to Delete the certificate and reset configuration?
fr: Souhaitez-vous supprimer le certificat et réinitialiser la configuration?

# ConfirmDeleteConfiguration
source: Are you sure you wish to delete the Extra Configuration
fr: Êtes-vous sûr de vouloir supprimer la configuration supplémentaire

# ConfirmGenerateCertificateDomainsServiceEmail
source: Are you sure you want to Generate a Certificate for the following domains {0} using a service at {1} and registering with the e-mail address {2}.
fr: Êtes-vous sûr de vouloir générer un certificat pour les domaines suivants {0} en utilisant un service sur {1} et en vous inscrivant avec l'adresse e-mail {2}.

# ConfirmNewConfiguration
source: Are you sure you want to create a new Extra Configuration:
fr: Êtes-vous sûr de vouloir créer une nouvelle configuration supplémentaire:

# ConfirmRevokeCertificate
source: Are you sure you wish to Revoke and delete the Certificate?
fr: Êtes-vous sûr de vouloir révoquer et supprimer le certificat?

# ConfirmUpdateSettings
source: Are you sure you want to update the Settings?
fr: Voulez-vous vraiment mettre à jour les paramètres?

source: Create new Configuration
fr: Créer une nouvelle configuration

# CreatingTask
source: Creating Scheduled Task...
fr: Création d'une tâche planifiée...

# CreatingTaskIfRequired
source: Creating Scheduled Task if required...
fr: Création d'une tâche planifiée si nécessaire...

# DaysBeforeRenewal
source: Days before Renewal Period will be updated to
fr: Les jours avant la période de renouvellement seront mis à jour pour

source: Default Configuration
fr: Configuration par défaut

source: Delete
fr: Effacer

# DeletingTask
source: Deleting Scheduled Task...
fr: Suppression de la tâche planifiée...

source: Domains
fr: Domaines

# DomainsRequired
source: Domains to generate certificate for are required.
fr: Les domaines pour lesquels générer un certificat sont requis.

source: Error
fr: Erreur

# ErrorACMEServiceEmail
source: Could not register ACME service account with service address: {0} and e-mail address: {1}
fr: Impossible d'enregistrer le compte de service ACME avec l'adresse de service: {0} et l'adresse e-mail: {1}

# ErrorBindingCertificateGenerated
source: Error Binding to IIS Site, but certificate generated.
fr: Erreur de liaison au site IIS, mais certificat généré.

# ErrorFailedCleaningUp
source: Failed to Verify, cleaning up...
fr: Échec de la vérification, nettoyage...

# ErrorFindCertificate
source: Could not find configuration or configuration does not match Certificate domains.
fr: Impossible de trouver la configuration ou la configuration ne correspond pas aux domaines de certificat.

# ErrorGetBinding
source: Cound not read IIS binding, try resetting IIS, continuing:
fr: Impossible de lire la liaison IIS, essayez de réinitialiser IIS, en continuant:

# ErrorGetBindingFail
source: Cound not read IIS binding, try resetting IIS, breaking:
fr: Impossible de lire la liaison IIS, essayez de réinitialiser IIS, en cassant:

source: Error issuing Certificate.
fr: Erreur lors de l'émission du certificat.

# ErrorRetrievingCertificate
source: Unable to retreive the generated Certificate.
fr: Impossible de récupérer le certificat généré.

# ErrorRevokingCertificate
source: Error revoking certificate, it could already be revoked.
fr: Erreur lors de la révocation du certificat, il pourrait déjà être révoqué.

# ErrorSpecifyHTTPorDNS
source: Specify either an HTTP or a DNS validation method.
fr: Spécifiez une méthode de validation HTTP ou DNS.

# ExecutePS
source: Execute PowerShell Script:
fr: Exécutez le script PowerShell:

# ExecutingPS
source: Executing PowerShell Script if required...
fr: Exécution du script PowerShell si nécessaire...

source: Extra
fr: En plus

source: Extra Configuration:
fr: Configuration supplémentaire:

# FailedCertBindIIS
source: Certificate failed to bind to IIS Site.
fr: Le certificat n'a pas pu se lier au site IIS.

source: Generate Certificate?
fr: Générer un certificat?

# GenerateDomains
source: Domains to Generate certificate for:
fr: Domaines pour générer un certificat pour:

# GettingExistingCertificate
source: Getting Existing Certificate from Configuration...
fr: Obtention du certificat existant à partir de la configuration...

source: Getting HTTP Validator...
fr: Obtention du validateur HTTP...

source: Help
fr: Aider

# HelpText
source: WinCertes allows you to generate a free certificate using Lets Encrypt or a service of your choice. You must start by entering the e-mail address you will be registering the certificate with. If you are using IIS, simply select the Local IIS Server radio button, now select the IIS Site you will be using for the challenge response and if you wish to bind the certificate after, tick the Bind to IIS Site box. If you are hosting multiple domains, you may want to ensure Server Name Indication is ticked. If you are using the Standalong HTTP Server, select the Standalone HTTP Server radio button and ensure the Server Port is Free, you can still select an IIS site if you wish to bind the certificate to one after generating it. The Domains box should contain the list of domains to generate the certificate for, if the IIS Site already has bindings, the names will automatically be added, otherwise you must add all the Domains you wish to add to the certificate, remember, this must also include www. If you want to renew automatically select Schedule a Task to Renew Automatically, 30 days is the default renewal time, it can be less if you want. If you wish to run a PowerShell Script after generating the certificate, click Browse and select it from the File System, or enter it in the Execute PowerShell Script box, the Tickbox should tick automatically. If you need the Execution Policy to be higher, select one from the PowerShell Execution Policy Dropdown box. Now click Issue Certificate to generate the certificate. Once the certificate is generated, you can view the certificate by pressing Show Certificate. If you need to Revoke the certificate, press the Revoke Certificate button. You can change the settings at any time, ready for the next renewal, or it will bind the certificate to another IIS Site for you. Any issues, please report the Issue to the peterlgarland/WinCertes GitHub repository.
fr: WinCertes vous permet de générer un certificat gratuit en utilisant Lets Encrypt ou un service de votre choix. Vous devez commencer par entrer l'adresse e-mail avec laquelle vous allez enregistrer le certificat. Si vous utilisez IIS, sélectionnez simplement le bouton radio Serveur IIS local, sélectionnez maintenant le site IIS que vous utiliserez pour la réponse au défi et si vous souhaitez lier le certificat après, cochez la case Lier au site IIS. Si vous hébergez plusieurs domaines, vous voudrez peut-être vous assurer que l'indication du nom du serveur est cochée. Si vous utilisez le serveur HTTP autonome, sélectionnez le bouton radio Serveur HTTP autonome et assurez-vous que le port du serveur est libre, vous pouvez toujours sélectionner un site IIS si vous souhaitez lier le certificat à un après l'avoir généré. La boîte Domaines doit contenir la liste des domaines pour lesquels générer le certificat, si le site IIS a déjà des liaisons, les noms seront automatiquement ajoutés, sinon vous devez ajouter tous les domaines que vous souhaitez ajouter au certificat, rappelez-vous, cela doit également inclure www. Si vous souhaitez renouveler automatiquement, sélectionnez Planifier une tâche pour un renouvellement automatique, 30 jours est la durée de renouvellement par défaut, elle peut être inférieure si vous le souhaitez. Si vous souhaitez exécuter un script PowerShell après avoir généré le certificat, cliquez sur Parcourir et sélectionnez-le dans le système de fichiers, ou saisissez-le dans la case Exécuter le script PowerShell, la case à cocher doit être cochée automatiquement. Si vous avez besoin que la stratégie d'exécution soit plus élevée, sélectionnez-en une dans la liste déroulante de la stratégie d'exécution PowerShell. Cliquez maintenant sur Émettre un certificat pour générer le certificat. Une fois le certificat généré, vous pouvez afficher le certificat en appuyant sur Afficher le certificat. Si vous devez révoquer le certificat, appuyez sur le bouton Révoquer le certificat. Vous pouvez modifier les paramètres à tout moment, prêt pour le prochain renouvellement, ou cela liera le certificat à un autre site IIS pour vous. En cas de problème, veuillez signaler le problème au référentiel peterlgarland/WinCertes GitHub.

# IIS
source: Local IIS Server
fr: Serveur IIS local

# IISBindingSNIFlag
source: IIS Binding SNI Ssl Flag will be updated to
fr: IIS Binding SNI Ssl Flag sera mis à jour pour

# IISBindNeedsSite
source: IIS Site is required to Bind Certificate to.
fr: Le site IIS est requis pour lier le certificat à.

# IISBindPortUpdate
source: IIS Binding Port will be updated to
fr: Le port de liaison IIS sera mis à jour pour

# IISPort
source: IIS Port to bind to:
fr: Port IIS à lier à:

source: IIS Settings
fr: Paramètres IIS

# IISSiteAtWebRootRenewal
source: IIS Site {0} with Web Root at {1} will be used for Challange response at renewal.
fr: Le site IIS {0} avec la racine Web à {1} sera utilisé pour la réponse au défi lors du renouvellement.

# IISSiteChallange
source: The IIS Site at {0} will be used for the Challange Response.
fr: Le site IIS à {0} sera utilisé pour la réponse au défi.

# InitCertes
source: Initializing Certes...
fr: Initialisation de Certes...

source: Issue Certificate
fr: Émettre un certificat

# IssuedCertificateIISPort
source: The Issued Certificate will be binded to the IIS Site {0} on Port {1}
fr: Le certificat émis sera lié au site IIS {0} sur le port {1}

source: Issuing Certificate...
fr: Délivrance du certificat...

source: New Configuration
fr: Nouvelle configuration

source: New Domain:
fr: Nouveau domaine:

# NoBindIIS
source: Certificate not bound to any IIS site
fr: Certificat non lié à un site IIS

# NoBindOnRenewal
source: The certificate will not be bound to an IIS Site on renewal.
fr: Le certificat ne sera pas lié à un site IIS lors du renouvellement.

source: <None>
fr: <Aucun>

# NoRebind
source: This will not unbind the Certificate from the IIS Site, but will not rebind it on renewal.
fr: Cela ne dissociera pas le certificat du site IIS, mais ne le rétablira pas lors du renouvellement.

source: Off
fr: À l'arrêt

source: On
fr: Sur

source: PORT {0} IN USE
fr: PORT {0} UTILISÉ

source: PORT IN USE
fr: PORT UTILISÉ

# PowerShell
source: PowerShell Core Script
fr: Script de base PowerShell

# PSExecPolicy
source: PowerShell Execution Policy:
fr: Politique d'exécution de PowerShell:

# PSExecSetting
source: Setting PowerShell Script Execution Policy will be updated to
fr: La définition de la stratégie d'exécution de script PowerShell sera mise à jour pour

# PSExecUpdate
source: PowerShell Script execution will be updated to
fr: L'exécution du script PowerShell sera mise à jour pour

# PSFilter
source: PowerShell Scripts (*.ps1)|*.ps1|All files (*.*)|*.*
fr: Scripts PowerShell (*.ps1)|*.ps1|Tous les fichiers (*.*)|*.*

# PSScriptExecSetting
source: PowerShell Script Execution Policy will be updated to
fr: La politique d'exécution de script PowerShell sera mise à jour pour

# PSScriptUpdate
source: PowerShell Script will be updated to
fr: Le script PowerShell sera mis à jour pour

# PSScriptWillBeExecuted
source: The PowerShell Script {0} will be executed after successfully issuing and/or binding the certificate
fr: Le script PowerShell {0} sera exécuté après l'émission et/ou la liaison réussie du certificat

# ReadyIssue
source: Ready to Issue Certificate.
fr: Certificat prêt à délivrer.

# ReadyRenew
source: Ready to Renew Certificate.
fr: Certificat prêt à renouveler.

# ReadyUpdate
source: Ready to Update Settings.
fr: Prêt à mettre à jour les paramètres.

# RecommendDelete
source: It is recommended to Revoke and Delete the Certificate first.
fr: Il est recommandé de révoquer et de supprimer d'abord le certificat.

source: REGISTERED
fr: INSCRIT

source: Registering New Account...
fr: Enregistrement d'un nouveau compte...

# RegisteringNewOrder
source: Registering New Order and Verifiying...
fr: Enregistrement d'une nouvelle commande et vérification...

source: Remove
fr: Supprimer

# RemovingCertificate
source: Removing Certificate from Configuration...
fr: Suppression du certificat de la configuration...

# RemovingTemp
source: Removing temporary files...
fr: Suppression des fichiers temporaires...

# RenewalDelay
source: Renew Days before Expiration:
fr: Jours de renouvellement avant l'expiration:

source: Renew Certificate
fr: Renouveler le certificat

source: Retrieving Certificate...
fr: Récupération du certificat...

source: Revoke Certificate
fr: Révoquer le certificat

# RevokingCertificate
source: Revoking Certificate with ACME Service...
fr: Révocation du certificat avec le service ACME...

source: Scheduled Task
fr: Tâche planifiée

# ScheduleTaskAuto
source: Schedule a Task to Renew Automatically
fr: Planifier une tâche à renouveler automatiquement

source: Server:
fr: Serveur:

source: Server Port:
fr: Port de serveur:

source: Settings
fr: Paramètres

source: Settings Updated.
fr: Paramètres mis à jour.

source: Show Certificate
fr: Afficher le certificat

source: Site Bindings:
fr: Liens du site:

# SNI
source: Server Name Indication
fr: Indication du nom du serveur

# Standalone
source: Standalone HTTP Server
fr: Serveur HTTP autonome

# StandaloneRequiresPort
source: Standalone HTTP Server requires a Port that is Not in Use.
fr: Le serveur HTTP autonome nécessite un port qui n'est pas utilisé.

# StandaloneSettings
source: Standalone HTTP Server Settings
fr: Paramètres du serveur HTTP autonome

# StandaloneUsedResponseOnPort
source: A Standalone HTTP Server on Port {0} will be used for the Challange Response.
fr: Un serveur HTTP autonome sur le port {0} sera utilisé pour la réponse au défi.

# StandaloneWarning
source: All Challenges are processed on Port 80, if you use a different port above you must set Port Forwarding on your Router accordingly.
fr: Tous les défis sont traités sur le port 80, si vous utilisez un autre port ci-dessus, vous devez définir la redirection de port sur votre routeur en conséquence.

source: Storing Certificate...
fr: Stockage du certificat...

source: Success
fr: Succès

# SuccessBindIIS
source: Successfully bound certificate for IIS site:
fr: Certificat lié avec succès pour le site IIS:

# SuccessCertBoundIIS
source: Certificate successfully rebound to IIS Site.
fr: Le certificat a rebondi avec succès sur le site IIS.

# TaskCreatedDaysBefore
source: A Scheduled Task will be created to insure the certificate is renewed within {0} of expiry.
fr: Une tâche planifiée sera créée pour s'assurer que le certificat est renouvelé dans les {0} de son expiration.

# TaskWillBeCreated
source: A Task will be Scheduled to renew the certificate automatically.
fr: Une tâche sera planifiée pour renouveler automatiquement le certificat.

# TaskWillBeDeleted
source: The Scheduled Task will be deleted so the certificate will not be renewed automatically.
fr: La tâche planifiée sera supprimée afin que le certificat ne soit pas renouvelé automatiquement.

# UpdateIISSetting
source: Update IIS Settings
fr: Mettre à jour les paramètres IIS

source: Update Settings
fr: Mettre à jour les paramètres

source: Updating Settings...
fr: Mise à jour des paramètres...

# ValidEmail
source: Valid E-mail is Required.
fr: Un e-mail valide est requis.

# ValidService
source: Valid Service address is Required.
fr: Une adresse de service valide est requise.

source: Verified, cleaning up...
fr: Vérifié, nettoyage...

# WebRootChallange
source: Web Root for Challange:
fr: Racine Web pour le défi:

# WithPSExecPolicy
source: with the Execution Policy set to
fr: avec la règle d'exécution définie sur

# WithSNI
source: with the SNI Ssl Flag on.
fr: avec le drapeau SNI Ssl allumé.

# WritingConfiguration
source: Writing new Configuration...
fr: Écriture de la nouvelle configuration...

# WritingSettings
source: Writing Settings into Configuration...
fr: Écriture des paramètres dans la configuration...
